modules/jaxws-integration/test-resources/xml/addnumberstest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header> 
			<ns1:myHeader xmlns:ns1="http://org/test/addnumbershandler">Good1</ns1:myHeader>
			<ns1:myHeader xmlns:ns1="http://org/test/addnumbershandler" soap:actor="http://schemas.xmlsoap.org/soap/actor/next">Good2</ns1:myHeader>
			<ns1:myHeader xmlns:ns1="http://org/test/addnumbershandler" soap:actor="http://badActor">Bad</ns1:myHeader>
		</soap:Header>
 		<soap:Body> 
			<ns2:addNumbersHandler xmlns:ns2="http://org/test/addnumbershandler">
			<ns2:arg0>10</ns2:arg0>
			<ns2:arg1>10</ns2:arg1>
			</ns2:addNumbersHandler>
		</soap:Body>
	</soap:Envelope>